app/views/api/v1/todos/index.json.jbuilder

SELECT "todo_labels".* FROM "todo_labels" WHERE "todo_labels"."todo_id" IN (?, ?)  [["todo_id", 355], ["todo_id", 356]]
---
  json.extract! todo, :id, :title, :todo_date, :body, :status, :created_at
  if todo.labels.present?