app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "guest@example.com"], ["LIMIT", 1]]
---
      def guest
        user = User.find_by(email: "guest@example.com")