app/models/label.rb

  def label_counts_must_be_within_limit
    errors.add(:base, 'ラベルが登録できるのは10個までです') if user.labels.size > 10
---
SELECT COUNT(*) FROM "labels" WHERE "labels"."user_id" = ?  [["user_id", 1]]