app/models/shortcut.rb

  default_scope -> { order(created_at: :desc) }

  private def shortcut_counts_must_be_within_limit
    if user.shortcuts.count >= MAX_SHORTCUT_COUNT
---
SELECT COUNT(*) FROM "shortcuts" WHERE "shortcuts"."user_id" = ?  [["user_id", 1]]