app/models/user.rb

SELECT 1 AS one FROM "users" WHERE LOWER("users"."email") = LOWER(?) AND "users"."id" != ? LIMIT ?  [["email", "guest@example.com"], ["id", 6], ["LIMIT", 1]]
---
    def email_used?(user, email)
      existing_user = find_by('email = ?', email)
      existing_user.present? && existing_user != user

UPDATE "users" SET "remember_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["remember_digest", "$2a$12$HcCRCnTfQ.2eJuPvY.TMau9wWgKgGKiMpOCbietBd/5d3Nwtu.oqW"], ["updated_at", "2022-06-19 03:11:46.026720"], ["id", 6]]
---
    def find_or_create_from_oauth(auth)
      provider = auth[:provider]
      uid = auth[:uid]
      name = auth[:info][:name]
      email = auth[:info][:email]

      if user = User.find_by(email: email)
        if provider == 'twitter' && user.twitter_uid.nil?
          user.update(twitter_uid: uid)