app/models/user.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def uniqueness_unconfirmed_eamil_with_email
    if User.exists?(email: unconfirmed_email)